; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 916968 2 2 3 6 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	image2 - mode
	spectrograph0 - mode
	infrared1 - mode
	Star1 - direction
	GroundStation5 - direction
	Star0 - direction
	Star4 - direction
	Star3 - direction
	GroundStation2 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star0)
	(supports instrument1 spectrograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation5)
	(supports instrument2 image2)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 Star4)
	(supports instrument3 image2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon6)
)
(:goal (and
	(pointing satellite0 Star7)
	(pointing satellite1 Phenomenon6)
	(have_image Phenomenon6 infrared1)
	(have_image Star7 infrared1)
	(have_image Phenomenon8 infrared1)
	(have_image Star9 infrared1)
	(have_image Star10 infrared1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 1 of 7
3. (turn_to satellite1 star9 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star9)
   goals met: 0 of 7
4. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 0 of 7
5. (turn_to satellite1 phenomenon6 star9)
   deleted: (pointing satellite1 star9)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 7
6. (turn_to satellite0 star7 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 star7)
   goals met: 2 of 7
7. (turn_to satellite1 groundstation2 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 groundstation2)
   goals met: 1 of 7
8. (take_image satellite0 star7 instrument0 infrared1)
   added: (have_image star7 infrared1)
   goals met: 2 of 7
9. (calibrate satellite1 instrument3 groundstation2)
   added: (calibrated instrument3)
   goals met: 2 of 7
10. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 1 of 7
11. (turn_to satellite1 star10 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star10)
   goals met: 1 of 7
12. (take_image satellite0 star9 instrument0 infrared1)
   added: (have_image star9 infrared1)
   goals met: 2 of 7
13. (take_image satellite1 star10 instrument3 infrared1)
   added: (have_image star10 infrared1)
   goals met: 3 of 7
14. (turn_to satellite0 star7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star7)
   goals met: 4 of 7
15. (turn_to satellite1 phenomenon8 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 phenomenon8)
   goals met: 4 of 7
16. (take_image satellite1 phenomenon8 instrument3 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 5 of 7
17. (turn_to satellite0 phenomenon6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon6)
   goals met: 4 of 7
18. (turn_to satellite1 phenomenon6 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon6)
   goals met: 5 of 7
19. (take_image satellite0 phenomenon6 instrument0 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 6 of 7
20. (turn_to satellite0 star7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star7)
   goals met: 7 of 7
